Documents/ИнвентаризацияМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ИнвентаризацияМатериалов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПоУчету</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокФактический</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаУчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОтклонения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РегистрМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрМатериалов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ИнвентаризацияМатериалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Процедура выполняется на клиенте.
// Она запускается по команде "Заполнить по остаткам".
// Ее задача — заполнить табличную часть инвентаризации
// текущими остатками материалов по выбранному складу.
&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)

	// Сначала проверяем, указан ли склад в шапке документа.
	// Без склада нельзя получить остатки материалов.
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		
		// Сообщаем пользователю, что сначала нужно выбрать склад.
		Сообщить("Сначала укажите склад.");
		
		// Завершаем выполнение процедуры.
		Возврат;
		
	КонецЕсли;

	// Если склад заполнен, вызываем серверную процедуру,
	// которая получит остатки из регистра накопления.
	ЗаполнитьПоОстаткамНаСервере();

КонецПроцедуры


// Процедура выполняется на сервере.
// Она получает остатки материалов по выбранному складу
// и заполняет ими табличную часть документа инвентаризации.
&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере()

	// Получаем объект документа из формы.
	// Это нужно, чтобы на сервере работать с табличной частью документа.
	ДокОбъект = РеквизитФормыВЗначение("Объект");

	// Дополнительно проверяем, указан ли склад.
	// Проверка дублируется на сервере для надежности.
	Если Не ЗначениеЗаполнено(ДокОбъект.Склад) Тогда
		ВызватьИсключение "Не указан склад.";
	КонецЕсли;

	// Очищаем табличную часть "Материалы",
	// чтобы перед заполнением в ней не осталось старых строк.
	ДокОбъект.Материалы.Очистить();

	// Создаем запрос к базе данных.
	Запрос = Новый Запрос;
	
	// Запрос получает остатки материалов по выбранному складу.
	// Используется виртуальная таблица Остатки регистра накопления "РегистрМатериалов".
	// Получаем материал, количество остатка и сумму остатка.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Материал КАК Материал,
	|	Остатки.КоличествоОстаток КАК КоличествоОстаток,
	|	Остатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.РегистрМатериалов.Остатки(
	|		&Момент,
	|		Склад = &Склад
	|	) КАК Остатки
	|ГДЕ
	|	Остатки.КоличествоОстаток <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Остатки.Материал";

	// Устанавливаем момент получения остатков.
	// Остатки берутся на конец дня даты документа.
	Запрос.УстановитьПараметр("Момент", КонецДня(ДокОбъект.Дата));
	
	// Передаем в запрос склад из документа.
	Запрос.УстановитьПараметр("Склад", ДокОбъект.Склад);

	// Выполняем запрос и получаем выборку результата.
	Выборка = Запрос.Выполнить().Выбрать();

	// Перебираем все найденные остатки материалов.
	Пока Выборка.Следующий() Цикл

		// Добавляем новую строку в табличную часть "Материалы".
		НоваяСтрока = ДокОбъект.Материалы.Добавить();

		// Заполняем материал из результата запроса.
		НоваяСтрока.Материал = Выборка.Материал;
		
		// Заполняем учетный остаток.
		// Это количество, которое числится в базе по выбранному складу.
		НоваяСтрока.ОстатокПоУчету = Выборка.КоличествоОстаток;

		// Фактический остаток пользователь должен ввести сам
		// после реального пересчета материалов на складе.
		НоваяСтрока.ОстатокФактический = 0;

		// Пока фактический остаток не введен,
		// отклонение и сумма отклонения равны 0.
		НоваяСтрока.Отклонение = 0;
		НоваяСтрока.СуммаОтклонения = 0;

		// Если количество остатка не равно нулю,
		// рассчитываем учетную цену материала.
		Если Выборка.КоличествоОстаток <> 0 Тогда
			
			// Учетная цена = сумма остатка / количество остатка.
			// Результат округляется до двух знаков после запятой.
			НоваяСтрока.ЦенаУчета = Окр(Выборка.СуммаОстаток / Выборка.КоличествоОстаток, 2);
			
		Иначе
			
			// Если количество равно нулю, цену рассчитать нельзя.
			НоваяСтрока.ЦенаУчета = 0;
			
		КонецЕсли;

	КонецЦикла;

	// Передаем измененный объект документа обратно в форму,
	// чтобы пользователь увидел заполненную табличную часть.
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");

КонецПроцедуры


// Процедура выполняется на клиенте.
// Она срабатывает, когда пользователь изменяет фактический остаток
// в строке табличной части.
&НаКлиенте
Процедура МатериалыОстатокФактическийПриИзменении(Элемент)

	// После изменения фактического остатка нужно пересчитать отклонение
	// и сумму отклонения по текущей строке.
	ПересчитатьСтроку();

КонецПроцедуры


// Процедура выполняется на клиенте.
// Она срабатывает, когда изменяется учетный остаток.
&НаКлиенте
Процедура МатериалыОстатокПоУчетуПриИзменении(Элемент)

	// После изменения учетного остатка пересчитываем отклонение.
	ПересчитатьСтроку();

КонецПроцедуры


// Процедура выполняется на клиенте.
// Она срабатывает, когда пользователь изменяет учетную цену материала.
&НаКлиенте
Процедура МатериалыЦенаУчетаПриИзменении(Элемент)

	// После изменения цены нужно пересчитать сумму отклонения.
	ПересчитатьСтроку();

КонецПроцедуры


// Процедура пересчитывает текущую строку табличной части "Материалы".
// Она считает отклонение между фактическим и учетным остатком,
// а также сумму этого отклонения.
&НаКлиенте
Процедура ПересчитатьСтроку()

	// Получаем текущую строку табличной части.
	Стр = Элементы.Материалы.ТекущиеДанные;

	// Если текущая строка не определена,
	// пересчитывать нечего.
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Если учетный остаток не заполнен,
	// считаем его равным нулю.
	Если Не ЗначениеЗаполнено(Стр.ОстатокПоУчету) Тогда
		Стр.ОстатокПоУчету = 0;
	КонецЕсли;

	// Если фактический остаток не заполнен,
	// считаем его равным нулю.
	Если Не ЗначениеЗаполнено(Стр.ОстатокФактический) Тогда
		Стр.ОстатокФактический = 0;
	КонецЕсли;

	// Если учетная цена не заполнена,
	// считаем ее равной нулю.
	Если Не ЗначениеЗаполнено(Стр.ЦенаУчета) Тогда
		Стр.ЦенаУчета = 0;
	КонецЕсли;

	// Рассчитываем отклонение:
	// фактический остаток минус остаток по учету.
	// Если результат отрицательный — это недостача.
	// Если результат положительный — это излишек.
	Стр.Отклонение = Стр.ОстатокФактический - Стр.ОстатокПоУчету;
	
	// Рассчитываем сумму отклонения:
	// отклонение умножается на учетную цену.
	// Результат округляется до двух знаков после запятой.
	Стр.СуммаОтклонения = Окр(Стр.Отклонение * Стр.ЦенаУчета, 2);

КонецПроцедуры
